---
kind: method
id: M:Autodesk.Revit.DB.TypeBinding.#ctor(Autodesk.Revit.DB.CategorySet)
source: html/e3c23bb6-9963-6963-95d4-71eaf9e32cc9.htm
---
# Autodesk.Revit.DB.TypeBinding.#ctor Method

Constructs a type binding with the set of categories passed.

## Syntax (C#)
```csharp
public TypeBinding(
	CategorySet categories
)
```

## Parameters
- **categories** (`Autodesk.Revit.DB.CategorySet`)

## Remarks
Categories can be set or changed at a later time by using the Categories property of this object.